-- 外部キー制約を一時的に無効化
SET foreign_key_checks = 0;

-- 初期データを作成
-- メタ太郎（pw: admin）
INSERT INTO mt_library.accounts
    (id, employee_id, name, email, password, authorization_type)
VALUES
    (1, '000001', '管理太郎', 'admin@example.com', '$2a$10$sI.U8nPC19YYlHo60B./ku/k411YndrvU2Rl65Pvs7FiZDNr0t04i', 1);

INSERT INTO mt_library.book_mst
    (id, isbn, title, deleted_at, created_at, updated_at)
VALUES
    (1, '9784295017936', 'スッキリわかるJava入門 第4版', NULL, '2024-03-01 10:00:00', '2024-03-01 11:00:00'),
    (2, '9784295015574', 'かんたん合格 ITパスポート教科書&必須問題 令和5年度', NULL, '2024-03-01 10:10:00', '2024-03-01 11:10:00'),
    (3, '9784284204705', '13歳から分かる！7つの習慣', NULL, '2024-03-02 10:20:00', '2024-03-05 10:00:00'),
    (4, '9784594030193', 'チーズはどこへ消えた？', NULL, '2024-03-03 10:00:00', '2024-03-03 12:00:00'),
    (5, '9784845263424', '高業績チームはここが違う', NULL, '2024-03-03 11:00:00', '2024-03-03 12:15:00');

INSERT INTO mt_library.stocks
    (id, book_id, status, price, created_at, updated_at)
VALUES
    ('A00001', 1, 1, 2970, '2024-03-01 10:00:00', '2024-03-01 11:00:00'),
    ('A00002', 2, 0, 1628, '2024-03-01 10:10:00', '2024-03-01 11:10:00'),
    ('A00003', 3, 0, 1430, '2024-03-02 10:20:00', '2024-03-05 10:00:00'),
    ('A00004', 4, 0, 921, '2024-03-03 10:00:00', '2024-03-03 12:00:00'),
    ('A00005', 5, 0, 2200, '2024-03-03 11:00:00', '2024-03-03 12:15:00'),
    ('A00006', 1, 0, 2970, '2024-03-05 10:00:00', '2024-03-05 10:00:00'),
    ('A00007', 1, 0, 2970, '2024-03-06 10:00:00', '2024-03-05 10:00:00'),
    ('A00008', 1, 0, 2970, '2024-03-07 10:00:00', '2024-03-05 10:00:00');

INSERT INTO mt_library.rental_manage
    (id, stock_id, employee_id, status, expected_rental_on, expected_return_on, rentaled_at, returned_at, canceled_at, created_at, updated_at)
VALUES
    (1, 'A00001', '000001', 1, '2024-03-01', '2025-03-01', '2024-03-01 11:30:00', NULL, NULL, '2024-03-01 10:00:00','2024-03-01 11:30:00'),
    (2, 'A00002', '000001', 0, '2024-03-02', '2025-03-01', NULL, NULL, NULL, '2024-03-01 10:00:00','2024-03-01 11:30:00'),
    (3, 'A00003', '000001', 0, '2024-03-01', '2024-03-10', '2024-03-01 10:10:00', '2024-03-10 09:00:00', NULL, '2024-03-01 10:00:00','2024-03-01 11:30:00');


-- 外部キー制約を有効化
SET foreign_key_checks = 1;